In [1]:
from bs4 import BeautifulSoup
import pandas as pd
import requests

In [2]:
page = requests.get('https://sos.ga.gov/elections/election_results/2010_0810/0044701.htm')
soup = BeautifulSoup(page.text, 'html.parser')

In [3]:
table = soup.find_all("table")[2]

In [4]:
df = pd.read_html(str(table), flavor='bs4')

In [5]:
df = df[1]

In [6]:
df.shape

(9, 8)

In [7]:
df.head(5)

        0     1             2            3               4   5   6   7
0     NaN   NaN  Coley  7,257  Ginn  8,964  Totals  16,221 NaN NaN NaN
1     NaN   NaN         44.7%        55.3%          100.0% NaN NaN NaN
2  County   PPR           NaN          NaN             NaN NaN NaN NaN
3  BARROW  100%          3141         2597            5738 NaN NaN NaN
4  CLARKE  100%           439          794            1233 NaN NaN NaN

In [8]:
df = df[3:]

In [9]:
df.head(5)

         0     1     2     3     4   5   6   7
3   BARROW  100%  3141  2597  5738 NaN NaN NaN
4   CLARKE  100%   439   794  1233 NaN NaN NaN
5   ELBERT  100%    90   233   323 NaN NaN NaN
6  JACKSON  100%  2306  2344  4650 NaN NaN NaN
7  MADISON  100%   745  2211  2956 NaN NaN NaN

In [10]:
df = df[df.columns[[0,2,3]]]

In [11]:
df.head(5)

         0     2     3
3   BARROW  3141  2597
4   CLARKE   439   794
5   ELBERT    90   233
6  JACKSON  2306  2344
7  MADISON   745  2211

In [12]:
df.columns = ['county', 'Shane Coley', 'Frank Ginn']

In [13]:
df.tail(5)

       county Shane Coley Frank Ginn
4      CLARKE         439        794
5      ELBERT          90        233
6     JACKSON        2306       2344
7     MADISON         745       2211
8  OGLETHORPE         536        785

In [14]:
df = df.melt(id_vars=['county'])

In [15]:
df.columns = ['county', 'candidate', 'votes']

In [16]:
df.head()

    county    candidate votes
0   BARROW  Shane Coley  3141
1   CLARKE  Shane Coley   439
2   ELBERT  Shane Coley    90
3  JACKSON  Shane Coley  2306
4  MADISON  Shane Coley   745

In [17]:
df['votes'] = df['votes'].astype(int)

In [18]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 3 columns):
county       12 non-null object
candidate    12 non-null object
votes        12 non-null int64
dtypes: int64(1), object(2)
memory usage: 368.0+ bytes

In [19]:
df['office'] = 'State Senate'

In [20]:
df['district'] = '47'

In [21]:
df['party'] = 'Republican'

In [22]:
df.groupby(['candidate', 'party'])['votes'].sum()

candidate    party
Frank Ginn   Republican    8964
Shane Coley  Republican    7257
Name: votes, dtype: int64

In [23]:
df[['county', 'office', 'district', 'party', 'candidate', 'votes']].head()

    county        office district       party    candidate  votes
0   BARROW  State Senate       47  Republican  Shane Coley   3141
1   CLARKE  State Senate       47  Republican  Shane Coley    439
2   ELBERT  State Senate       47  Republican  Shane Coley     90
3  JACKSON  State Senate       47  Republican  Shane Coley   2306
4  MADISON  State Senate       47  Republican  Shane Coley    745

In [24]:
df[['county', 'office', 'district', 'party', 'candidate', 'votes']].to_clipboard(index=False, sep=',')